{
    "data": {
        "filmes": [
            {
                "id": "1",
                "imagemBanner": "https://images.bauerhosting.com/legacy/empire-tmdb/films/272/images/65JWXDCAfwHhJKnDwRnEgVB411X.jpg?ar=16%3A9&fit=crop&crop=top&auto=format&w=1440&q=80",
                "imagem": "https://img-cdn.sfanytime.com/COVERM/ba242472-c422-41dd-a724-9f81010f54bf_COVERM_01.jpg?w=375&fm=pjpg&s=cd8710e230dbe303f7f9795a38beba57",
                "nome": "Batman Begins",
                "descricao": "Em Batman Begins, o aclamado diretor Christopher Nolan explora as origens do legendário Cavaleiro das trevas. Na busca pelos assassinos dos seus pais, o desiludido herdeiro Bruce Wayne viaja pelo mundo reunindo recursos para combater a injustiça e amedrontar aqueles que semeiam o medo. Com a ajuda de seu mordomo de confiança, Alfred, do detetive Lt. James Gordon e do seu aliado Lucius Fox, Wayne retorna para Gotham city e liberta seu alter ego: Batman, um vigilante mascarado que usa sua força, intelecto e um arsenal de alta tecnologia para combater as forças sinistras que ameaçam a cidade.",
                "duracao": "2h 20m",
                "genero": "Ação/Crime",
                "estrelas": "⭐️⭐️⭐️⭐️⭐️",
                "link": "https://redecanais.la/batman-begins-dublado-2005-1080p_5e368c848.html"
            },
            {
                "id": "2",
                "imagemBanner": "https://t2.tudocdn.net/601410?w=1920",
                "imagem": "https://lumiere-a.akamaihd.net/v1/images/poster_semd_c4c0dfaa.png",
                "nome": "Shang-Chi",
                "descricao": "Em Shang-Chi e a Lenda dos Dez Anéis, Shang-Chi (Simu Liu) é um jovem chinês que abandonou seu país e seu pai, que lhe treinou desde criança nas artes marciais para ser um assassino ao seu dispor. Seu pai porta Dez Anéis que lhe dão poderes e longevidade, vivendo por séculos. Porém ao conhecer a mãe de Shang-Chi, ele se apaixona e tenta mudar sua vida, mas ela morre anos depois de dar a luz para a irmã mais nova de Shang-Chi, voltando causar tumulto na China.",
                "duracao": "2h 12mm",
                "genero": "Ação/Aventura",
                "estrelas": "⭐⭐⭐⭐⭐",
                "link": "https://redecanais.la/shang-chi-e-a-lenda-dos-dez-aneis-dublado-2021-1080p_4d1355849.html"
            },
            {
                "id": "3",
                "imagemBanner": "https://m.media-amazon.com/images/M/MV5BN2RkMTVhNzItMzdmZi00MTExLThiN2UtYjhiMDgwNWNjMmE0XkEyXkFqcGdeQWRvb2xpbmhk._V1_.jpg",
                "imagem": "https://m.media-amazon.com/images/M/MV5BNDg0N2NiZTAtZWVjNy00YmJlLWI0NDktMjFkMmRiZGIyNzRmXkEyXkFqcGdeQXVyMTA1OTcyNDQ4._V1_.jpg",
                "nome": "Din e o Dragão Genial",
                "descricao": "“Wish Dragon ou Din e o Dragão Genial” apresenta-nos o jovem Din, um rapaz humilde e trabalhador que sonha reencontrar Li Na, a sua melhor amiga de infância. Hoje em dia ela é uma jovem de classe alta e por isso o reencontro é algo praticamente inconcebível na mente de Din. Para esquecer essa diferença astronómica de classe na sociedade, ele usa um placard com a imagem dela como “amigo” e “confidente”. O que ele não esperava era ter a preciosa ajuda de Long Zhu, um Dragão dos Desejos que lhe concede três desejos.",
                "duracao": "1h 38m",
                "genero": "Comédia/Fantasia",
                "estrelas": "⭐⭐⭐⭐",
                "link": "https://redecanais.la/din-e-o-dragao-genial-dublado-2021-1080p_ecddc9280.html"
            },
            {
                "id": "4",
                "imagemBanner": "https://cinepop.com.br/wp-content/uploads/2019/11/thor-e-jane.jpeg",
                "imagem": "https://play-lh.googleusercontent.com/GYwHh2KMNaVSCJHO4RkR-pXDAmu5Ff40nSfeOOyIIll6QWz0Z_vNJhYeg-UkW32zo366cXfCXl0AdA-HL-o",
                "nome": "Thor: Amor e Trovão",
                "descricao": "Após os acontecimentos de Ultimato, Thor ansiando por um propósito, retorna a Nova Asgard e sua aposentadoria é interrompida por um assassino galáctico conhecido como Gorr, o Carniceiro de Deus, que busca a extinção dos deuses. Para combater a ameaça, Thor pede a ajuda da Rainha Valquíria, Korg e Jane Foster, sua ex-namorada, que - para surpresa de Thor - inexplicavelmente consegue empunhar seu martelo mágico, Mjolnir, o que imbuiu Jane com o poder de Thor.",
                "duracao": "1h 59m",
                "genero": "Ação/Aventura",
                "estrelas": "⭐⭐",
                "link": "https://redecanais.la/thor-amor-e-trovao-dublado-2022-1080p_27a4377f5.html"
            },
            {
                "id": "5",
                "imagemBanner": "https://images.squarespace-cdn.com/content/v1/5ce331b47a39b9000198fffa/36ab63af-9b39-4cf2-9bc7-6a2cffb7c37f/Ryan+Meinerding_Spider-Man-+No+Way+Home.jpeg",
                "imagem": "https://resizing.flixster.com/8PNiwC2bpe9OecfYZSOVkvYC5vk=/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzL2U5NGM0Y2Q1LTAyYTItNGFjNC1hNWZhLWMzYjJjOTdjMTFhOS5qcGc=",
                "nome": "Homem-Aranha: Sem volta para casa",
                "descricao": "Peter Parker precisará lidar com as consequências da sua identidade como o herói mais querido do mundo após ter sido revelada pela reportagem do Clarim Diário, com uma gravação feita por Mysterio no filme anterior. Incapaz de separar sua vida normal das aventuras de ser um super-herói, além de ter sua reputação arruinada por acharem que foi ele quem matou Mysterio e pondo em risco seus entes mais queridos, Parker pede ao Doutor Estranho para que todos esqueçam sua verdadeira identidade.",
                "duracao": "2h 28m",
                "genero": "Ação/Fantasia",
                "estrelas": "⭐⭐⭐⭐⭐",
                "link": "https://redecanais.la/homem-aranha-sem-volta-para-casa-dublado-2021-1080p_debac763f.html"
            },
            {
                "id": "6",
                "imagemBanner": "https://onlineseries.com.br/wp-content/uploads/2020/03/Viuva-Negra-filme-online.jpg",
                "imagem": "https://upload.wikimedia.org/wikipedia/pt/8/88/Black_Widow_%282020%29.jpg",
                "nome": "Viúva Negra",
                "descricao": "Em Viúva Negra, acompanhamos a vida de Natasha Romanoff (Scarlett Johansson) após os eventos de Guerra Civil. Se escondendo do governo norte-americano devido a sua aliança com o time do Capitão América, Natasha ainda precisa confrontar partes de sua história, que ela tanto evita, quando surge uma conspiração perigosa ligada ao seu passado. Perseguida por uma força que não irá parar até derrotá-la, ela terá que lidar com sua antiga vida de espiã, e também reencontrar membros de sua família que deixou para trás antes de se tornar parte dos Vingadores, e lidar com esses relacionamentos quebrados.",
                "duracao": "2h 13m",
                "genero": "Ação/Thriller",
                "estrelas": "⭐⭐⭐⭐",
                "link": "https://redecanais.la/viuva-negra-dublado-2021-1080p_9b12cb5d1.html"
            },
            {
                "id": "7",
                "imagemBanner": "https://pelhamexaminer.com/wp-content/uploads/2021/04/Raya-and-the-Last-Dragon.jpeg",
                "imagem": "https://lumiere-a.akamaihd.net/v1/images/p_rayaandthelastdragon_21294_83346778.jpeg",
                "nome": "Raya e o último Dragão",
                "descricao": "em uma região antiga e mágica, habitada por dragões mágicos que controlam o tempo e o redor, Raya é uma princesa de um país quebrado entre clãs. Porém, após uma terrível batalha entre dragões e o mal, os seres desapareceram, deixando a terra à mercê dos terríveis monstros que sugam qualquer vida e os transformam em pedra. Após uma reunião entre as tribos que acaba com seu clã sendo petrificado, Raya, agora uma exilada, sai em busca de um último dragão para que possa restabelecer a natureza do local. A princesa acaba encontrando Sisu, a última da espécie que decide ajudar Raya e deixar seus irmãos dragões orgulhosos.",
                "duracao": "1h 30m",
                "genero": "Aventura/Fantasia",
                "estrelas": "⭐⭐⭐⭐⭐",
                "link": "https://redecanais.la/raya-e-o-ultimo-dragao-dublado-2021-1080p_ad682afe0.html"
            },
            {
                "id": "8",
                "imagemBanner": "https://lumiere-a.akamaihd.net/v1/images/g_moana_20_17699_5291ba49_f6177500.jpeg?region=0,0,1300,730",
                "imagem": "https://cdn.shopify.com/s/files/1/0420/1044/3928/products/00873Moana_Blackstone__Rounded_300x.png?v=1628241005",
                "nome": "Moana",
                "descricao": "Moana Waialiki é uma corajosa jovem, filha única do chefe de uma tribo na Oceania, vinda de uma longa linhagem de navegadores. Quando os pescadores de sua ilha não conseguem pescar nenhum peixe e as colheitas falham, ela descobre que o semideus Maui causou a praga ao roubar o coração da deusa Te Fiti. A única maneira de curar a ilha é persuadir Maui a devolver o coração de Te Fiti, então Moana parte em uma jornada épica pelo Pacífico. Moana começa sua jornada em mar aberto, onde enfrenta terríveis criaturas marinhas e descobre histórias do submundo.",
                "duracao": "1h 53m",
                "genero": "Aventura/Musical",
                "estrelas": "⭐⭐⭐⭐⭐",
                "link": "https://redecanais.la/moana-um-mar-de-aventuras-dublado-2017-1080p-video_fa0df5dd3.html"
            },
            {
                "id": "9",
                "imagemBanner": "https://topmovies.com.br/wp-content/uploads/2023/10/Zootopia-2-previsao-de-data-de-lancamento-confirmacao-e-tudo.jpg",
                "imagem": "https://play-lh.googleusercontent.com/08OFc4ZChjqPFsSvgllfzSI0Uf0yIHVoNTPz73HHftTWdAnqsfsnzEYZnpySLNB4INgq",
                "nome": "Zootopia",
                "descricao": "acompanhamos a história de Judy Hopps, uma pequena fazendeira que é filha de agricultores. Insatisfeita com a vida no interior, ela tem sonhos maiores: se mudar para a cidade grande, Zootopia, e se tornar a primeira coelha policial. Quando Judy consegue alcançar o seu objetivo, ela é designada para a sua primeira e grande missão, que é encontrar um animal perdido. Contando com a ajuda inesperada de Nick, uma raposa conhecida por sua malícia e infrações, ela descobre que existe uma conspiração que afetará toda a cidade.",
                "duracao": "1h 48m",
                "genero": "Comédia/Aventura",
                "estrelas": "⭐⭐⭐⭐⭐",
                "link": "https://redecanais.la/zootopia-essa-cidade-e-o-bicho-dublado-2016-1080p_b94ee4e23.html"
            },
            {
                "id": "10",
                "imagemBanner": "https://cinepop.com.br/wp-content/uploads/2022/03/valente-7.jpg",
                "imagem": "https://m.media-amazon.com/images/I/71pFedOzRDL._AC_UF1000,1000_QL80_.jpg",
                "nome": "Valente",
                "descricao": "A jovem princesa Merida foi criada pela mãe para ser a sucessora perfeita ao cargo de rainha, seguindo a etiqueta e os costumes do reino. Mas a garota dos cabelos rebeldes não tem a menor vocação para esta vida traçada, preferindo cavalgar pelas planícies selvagens da Escócia e praticar o seu esporte favorito, o tiro ao arco. Quando uma competição é organizada contra a sua vontade, para escolher seu futuro marido, Merida decide recorrer à ajuda de uma bruxa, a quem pede que sua mãe mude. Mas quando o feitiço surte efeito, a transformação da rainha não é exatamente o que Merida imaginava... Agora caberá à jovem ajudar a sua mãe e impedir que o reino entre em guerra com os povos vizinhos.",
                "duracao": "1h 33m",
                "genero": "Fantasia/Aventura",
                "estrelas": "⭐⭐⭐⭐⭐",
                "link": "https://redecanais.la/valente-dublado-2012-1080p_147483518.html"
            },
            {
                "id": "11",
                "imagemBanner": "https://www.times-standard.com/wp-content/uploads/2023/06/0622_FEA_ETS-L-ELEMENTAL1.jpg?w=978",
                "imagem": "https://play-lh.googleusercontent.com/fpgX08FH-Ic7lfj8IW9fOZlabjBsmQ5LcVLIr31YQdoJyZsD6ZDfa7jkqBX9Sr823NyHk7qjZAl9gpuHChUI",
                "nome": "Elementos",
                "descricao": "Na história, somos apresentados à Faísca (fogo), uma mulher espirituosa na faixa dos vinte anos, com um grande senso de humor e apaixonada pela família, mas que tem um temperamento um pouco quente; Gota (água) é um jovem empático, observador e extrovertido, que não tem medo de demonstrar suas emoções - na verdade, é até um pouco difícil controlá-las; Turrão (terra) é um garoto muito inteligente da terra que mora na Vila do Fogo, e está sempre perto de Faísca; e Névoa (ar), que tem uma personalidade fofa e rosa, está sempre atenta às tendências da moda e é fã dos Windbreakers, um time de Air Ball.",
                "duracao": "1h 42m",
                "genero": "Romance/Fantasia",
                "estrelas": "⭐⭐⭐⭐⭐",
                "link": "https://redecanais.la/elementos-dublado-2023-1080p_885a1507d.html"
            },
            {
                "id": "12",
                "imagemBanner": "https://1.bp.blogspot.com/-F_ZIUMGAgQs/YQ92mcy8mbI/AAAAAAAAAEE/3l-20HhI_dUO00_i2kQmH6Uox-cEsf8oACLcBGAsYHQ/s1920/10-curiosidades-sobre-o-filme-a-fantastica-fabrica-de-chocolate.jpg",
                "imagem": "https://play-lh.googleusercontent.com/giMD69WYO9-iDW2cr-6dqrrVZj3gcZBWY_P-S1eNBlF2EJUtAaKQFtR80rn7S6zrqwv9",
                "nome": "A fantástica Fábrica de Chocolate",
                "descricao": "Baseado no conto de Roald Dahl, este cômico e fantástico filme segue o jovem Charlie Bucket e seu avô Joe. Eles se juntam a um pequeno grupo de ganhadores de uma competição, os quais vão para um passeio na mágica e misteriosa fábrica do excêntrico Willy Wonka. Ajudado por seus anões trabalhadores, Wonka esconde uma surpresa para durante o passeio.",
                "duracao": "1h 55m",
                "genero": "Fantasia/Infantil",
                "estrelas": "⭐⭐⭐⭐⭐",
                "link": "https://redecanais.la/a-fantastica-fabrica-de-chocolate-dublado-2005-1080p_b2e2cf558.html"
            },
            {
                "id": "13",
                "imagemBanner": "https://www.planoaberto.com.br/wp-content/uploads/2020/02/aves-capa.jpg",
                "imagem": "https://musicart.xboxlive.com/7/e94d5100-0000-0000-0000-000000000002/504/image.jpg?w=1920&h=1080",
                "nome": "Aves de Rapina: Arlequina e Sua Emancipação Fantabulosa",
                "descricao": "Em Aves de Rapina - Arlequina e sua Emancipação Fantabulosa, Arlequina, Canário Negro, Caçadora, Cassandra Cain e a policial Renée Montoya formam um grupo inusitado de heroínas. Quando um perigoso criminoso começa a causar destruição em Gotham, as cinco mulheres precisam se unir para defender a cidade.",
                "duracao": "1h 49m",
                "genero": "Ação/Comédia",
                "estrelas": "⭐⭐⭐⭐",
                "link": "https://redecanais.la/aves-de-rapina-arlequina-e-sua-emancipacao-fantabulosa-dublado-2020-1080p_ef2fa75d3.html"
            },
            {
                "id": "14",
                "imagemBanner": "https://napratica.org.br/wp-content/uploads/2019/07/divertidamente-e-ie.jpg",
                "imagem": "https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcRfHd-mM9MgWeQNmyKNg-dKuNcCaNVP8EOstPbFLz-JaBdIZ8wA",
                "nome": "Divertida Mente",
                "descricao": "Riley é uma garota divertida de 11 anos de idade, que deve enfrentar mudanças importantes em sua vida quando seus pais decidem deixar a sua cidade natal, no estado de Minnesota, para viver em San Francisco. Dentro do cérebro de Riley, convivem várias emoções diferentes, como a Alegria, o Medo, a Raiva, o Nojinho e a Tristeza. A líder deles é Alegria, que se esforça bastante para fazer com que a vida de Riley seja sempre feliz. Entretanto, uma confusão na sala de controle faz com que ela e Tristeza sejam expelidas para fora do local. Agora, elas precisam percorrer as várias ilhas existentes nos pensamentos de Riley para que possam retornar à sala de controle - e, enquanto isto não acontece, a vida da garota muda radicalmente.",
                "duracao": "1h 35m",
                "genero": "Comédia/Fantasia",
                "estrelas": "⭐⭐⭐⭐⭐",
                "link": "https://redecanais.la/naruto-classico-legendado-episodio-177-por-favor-senhor-carteiro-video_48d398122.html"
            },
            {
                "id": "15",
                "imagemBanner": "https://cinepop.com.br/wp-content/uploads/2022/12/o-gato-de-botas-2-o-ultimo-pedido.jpg",
                "imagem": "https://play-lh.googleusercontent.com/5-TYbrNAOgly4b0SThamjgJh1L-nXj_gia6HQjHG-SDxo3PJlcaxmQoYHL7tL97s_lxfSfgawf_yk1zd3-M",
                "nome": "Gato de Botas 2: O Último Pedido",
                "descricao": "O Gato de Botas descobre que sua paixão pela aventura cobrou seu preço: por conta de seu gosto pelo perigo e pelo desrespeito à segurança pessoal, ele queimou oito de suas nove vidas. Com apenas uma vida restante, o Gato precisa pedir ajuda para uma antiga parceira - que atualmente é sua rival e inimiga mortal, Kitty Pata Mansa - para continuar vivo. Então, o destemido bichano parte em uma jornada épica pela Floresta Negra para encontrar a mítica Estrela dos Desejos, capaz de proporcionar o legendário Último Desejo e restaurar suas nove vidas.",
                "duracao": "1h 42m",
                "genero": "Aventura/Comédia",
                "estrelas": "⭐⭐⭐⭐⭐",
                "link": "https://redecanais.la/gato-de-botas-2-o-ultimo-pedido-dublado-2023-1080p_f6e039f60.html"
            }
        ]
    }
}